[
    {
        "heading": "Swami Vivekanandas Vision for India Fulfilled",
        "description": "Union Minister Jitendra Singh stated that Prime Minister Narendra Modi has brought Swami Vivekananda's vision for India to life, enabling the country to lead the world in various fields.",
        "link": "https://www.oneindia.com/india/swami-vivekanandas-vision-for-india-realized-by-pm-modi-gen-3725677.html?ref=60sec"
    },
    {
        "heading": "Ayodhya Prepares for Grand Temple Event",
        "description": "Ayodhya is gearing up for the grand consecration ceremony of the Ram temple, with festive lighting, restrictions on construction, tourist guides, cleanliness drives, and special events.",
        "link": "https://www.oneindia.com/india/ayodhya-ram-temple-consecration-festive-preparations-gen-3725675.html?ref=60sec"
    },
    {
        "heading": "Hizbul Mujahideen Funding: Hawala Network Unearthed",
        "description": "In a major breakthrough, the Delhi Police Special Cell has uncovered a hawala network used to fund terror activities of the Hizbul Mujahideen in Jammu and Kashmir. Read the full story to learn how money was channeled from Pakistan under the guise of a Pashmina shawl and carpet business.",
        "link": "https://www.oneindia.com/india/hizbullah-terror-funding-exposed-hawala-channel-uncovered-delhi-police-gen-3725673.html?ref=60sec"
    },
    {
        "heading": "Gandhis Soft Power Strategy",
        "description": "National Security Advisor Ajit Doval highlighted Mahatma Gandhi's mastery of soft power in defeating stronger adversaries, during the launch of M.J. Akbar's book 'Gandhi, A Life in Three Campaigns'.",
        "link": "https://www.oneindia.com/india/gandhis-soft-power-strategy-praised-by-ajit-doval-gen-3725671.html?ref=60sec"
    },
    {
        "heading": "Ayodhya Temple Gifts",
        "description": "Guests attending the consecration ceremony of the Ram Mandir in Ayodhya will receive unique gifts, including soil from Ram Janmabhoomi and special Motichoor laddoos.",
        "link": "https://www.oneindia.com/india/ayodhya-temple-consecration-guests-receive-memorable-gifts-gen-3725669.html?ref=60sec"
    },
    {
        "heading": "Temple Encroachment Probe Ordered in Bengaluru",
        "description": "The Karnataka High Court has directed an investigation into claims that the Sri Sallapuradamma Temple in Bengaluru has encroached upon a public road, obstructing traffic and causing inconvenience to residents.",
        "link": "https://www.oneindia.com/india/temple-encroachment-bengaluru-high-court-orders-probe-gen-3725665.html?ref=60sec"
    },
    {
        "heading": "Noida Land Fraud: Man Held for Rs 24 Crore Scam",
        "description": "A man has been arrested in Noida for allegedly duping people of Rs 24 crore by selling them non-existent land parcels near the Noida International Airport.",
        "link": "https://www.oneindia.com/india/noida-man-held-rs-24-crore-land-fraud-near-airport-gen-3725663.html?ref=60sec"
    },
    {
        "heading": "HP Congress Chief Hails PM Modis Ram Temple Move",
        "description": "Himachal Pradesh Congress chief Pratibha Singh lauds Prime Minister Narendra Modi for taking the initiative to construct the Ram temple in Ayodhya, despite the party high command's decision not to attend the consecration event.",
        "link": "https://www.oneindia.com/india/pratibha-singh-praises-pm-modis-ram-temple-initiative-gen-3725661.html?ref=60sec"
    }
]